{
  "parent_url": "https://tech.nus.edu.sg/search/category?category_id=Health-Technologies",
  "extracted_date": "2025-10-15T16:15:27.104412",
  "total_count": 33,
  "pages_processed": 12,
  "urls": [
    {
      "id": "non-conductive-antistatic-material-esd-protection",
      "url": "http://tech.nus.edu.sg/non-conductive-antistatic-material-esd-protection",
      "title": "Other, Other, Other, OthersNon-Conductive Antistatic Material For ESD ProtectionElectrostatic discharge (ESD) is the sudden flow of electricity between two electrically-charged surfaces, which can be caused by repeated contact. This is a ch...- Soh Siow LingTRL5"
    },
    {
      "id": "rebuild-restore-reconstruct-improved-method-craniomaxillo-facial-surgery",
      "url": "http://tech.nus.edu.sg/rebuild-restore-reconstruct-improved-method-craniomaxillo-facial-surgery",
      "title": "Other, OtherRebuild, Restore, Reconstruct – An Improved Method for Craniomaxillo Facial SurgeryA novel software system for improved facial reconstruction \r\n\r\nPatients suffering from skull deformities, which could be caused by congenital abnormalities, tra...- Leow Wee Kheng, Lim Thiam ChyeTRL6"
    },
    {
      "id": "if-life-gives-you-surplus-bread-make-health-drink",
      "url": "http://tech.nus.edu.sg/if-life-gives-you-surplus-bread-make-health-drink",
      "title": "If life gives you surplus bread, make a health drinkWhen buying bread, consumers tend to select loaves with the furthest expiry date, leaving bread manufactured earlier, but still uncompromised in terms of qualit...- Liu Shao QuanTRL3"
    },
    {
      "id": "safe-and-approved-solution-eating-disorders-stapled-relaxin-3-b-chain-peptides-antagonists",
      "url": "http://tech.nus.edu.sg/safe-and-approved-solution-eating-disorders-stapled-relaxin-3-b-chain-peptides-antagonists",
      "title": "OtherA Safe and Approved Solution to Eating Disorders- Stapled Relaxin-3 B Chain Peptides AntagonistsAccording to a recent report by the National Association of Anorexia, every 62 minutes at least one person dies due to an eating disorder. The report also indic...- Gavin Stewart DaweTRL4"
    },
    {
      "id": "inhaled-protein-therapeutic-treatment-chronic-obstructive-pulmonary-disease",
      "url": "http://tech.nus.edu.sg/inhaled-protein-therapeutic-treatment-chronic-obstructive-pulmonary-disease",
      "title": "OtherInhaled protein therapeutic for treatment of Chronic Obstructive Pulmonary DiseaseChronic obstructive pulmonary disease (COPD) is a progressive life-threatening inflammatory lung disease characterized by chronic bronchitis (inflamed airways) ...- Ge Ruowen, Fred Wong Wai-shiuTRL3"
    },
    {
      "id": "earlier-detection-lung-cancer-better-patient-outcome",
      "url": "http://tech.nus.edu.sg/earlier-detection-lung-cancer-better-patient-outcome",
      "title": "Biomarker panel for early detection of Non-small Cell Lung CancerAmongst cancers, lung cancer is the leading cause of death, killing close to 1.8 million people globally each year. In 2020, about 2.2 million new cases were di...- Boon Cher GOH, Henry YANG, Lingzhi WANG, Sok Hwee, Esther CHEOWTRL3"
    },
    {
      "id": "antisense-oligonucleotide-based-therapy-treatment-liver-cancer",
      "url": "http://tech.nus.edu.sg/antisense-oligonucleotide-based-therapy-treatment-liver-cancer",
      "title": "OtherAntisense oligonucleotide-based therapy for treatment of liver cancerHepatocellular carcinoma (HCC) is a primary cancer of the liver and occurs predominantly in patients with underlying chronic liver disease such as Hep B or Hep ...- Chen LeileiTRL3"
    },
    {
      "id": "home-use-noodle-machine-customisable-nutritional-profile",
      "url": "http://tech.nus.edu.sg/home-use-noodle-machine-customisable-nutritional-profile",
      "title": "OtherHome-Use Noodle Machine with Customisable Nutritional ProfileAs consumers around the world place greater emphasis on the nutritional benefits of the food that they eat, the global health and wellness food market is expect...- Saif Abdul Kadir KhanTRL4"
    },
    {
      "id": "wireless-sensing-medical-sutures-post-surgery-monitoring",
      "url": "http://tech.nus.edu.sg/wireless-sensing-medical-sutures-post-surgery-monitoring",
      "title": "OtherWireless Sensing Medical Sutures for Post-Surgery MonitoringSensing technology is changing the way healthcare is delivered, with varied applications from wearable devices to remote healthcare monitoring networks. Globall...- John S Y HoTRL4"
    },
    {
      "id": "wireless-sensing-medical-sutures-post-surgery-monitoring",
      "url": "https://tech.nus.edu.sg/wireless-sensing-medical-sutures-post-surgery-monitoring",
      "title": "Wireless Sensing Medical Sutures for Post-Surgery…"
    },
    {
      "id": "advanced-food-image-recognition-technology-deep-learning",
      "url": "https://tech.nus.edu.sg/advanced-food-image-recognition-technology-deep-learning",
      "title": "Advanced Food Image Recognition Technology by…"
    },
    {
      "id": "new-low-cost-method-lithium-ion-battery-recycling",
      "url": "https://tech.nus.edu.sg/new-low-cost-method-lithium-ion-battery-recycling",
      "title": "New, Low-Cost Method for Lithium Ion Battery…"
    },
    {
      "id": "non-conductive-antistatic-material-esd-protection",
      "url": "https://tech.nus.edu.sg/non-conductive-antistatic-material-esd-protection",
      "title": "Non-Conductive Antistatic Material For ESD…"
    },
    {
      "id": "non-destructive-graphene-doping-nanoscale-electronics",
      "url": "http://tech.nus.edu.sg/non-destructive-graphene-doping-nanoscale-electronics",
      "title": "2D Materials, OtherNon-Destructive Graphene Doping for Nanoscale ElectronicsGraphene has been dubbed a “supermaterial” for good reason. At just one-atom thick, it is one of the strongest known materials today. It is also transparent...- Andrew Wee Thye Shen, Ariando, Chen WeiTRL4"
    },
    {
      "id": "electrical-contacts-molecular-electronics",
      "url": "http://tech.nus.edu.sg/electrical-contacts-molecular-electronics",
      "title": "Other, Integrated circuitsMoving Towards Molecular Electronics with Novel Electrode DesignCompared to the massive machines of the 1940s, today’s electronic devices are compact, yet more powerful than ever. This is made possible by creating progress...- Christian Albertus NIJHUIS, Albert WAN, Li JIANG, Suchand Sangeeth CHANDRAMATHI SUKUMARANTRL3"
    },
    {
      "id": "corrosion-protection-layer-magnetic-recording-media",
      "url": "http://tech.nus.edu.sg/corrosion-protection-layer-magnetic-recording-media",
      "title": "2D Materials, Other, OthersCorrosion Protection Layer for Magnetic Recording MediaWith a clear cost advantage, hard disk drives remain the most popular data storage media despite competition from solid state drives. In the third quarter of 20...- Antonio Helio de CASTRO NETO, Barbaros ÖzyilmazTRL3"
    },
    {
      "id": "attentional-factorisation-machine-model-better-predictive-analytics",
      "url": "http://tech.nus.edu.sg/attentional-factorisation-machine-model-better-predictive-analytics",
      "title": "OtherAttentional Factorisation Machine Model for Better Predictive AnalyticsThe massive market for Artificial intelligence (AI) continues to grow rapidly as more businesses turn to cognitive systems and AI software to create personalise...- Chua Tat-sengTRL4"
    },
    {
      "id": "optoelectronic-memories-next-generation-devices",
      "url": "http://tech.nus.edu.sg/optoelectronic-memories-next-generation-devices",
      "title": "Other, OtherOptoelectronic Memories for Next-Generation DevicesOptoelectronic memories are devices that can store photon-generated charge carriers when exposed to light. The stored charges can be accessed later for informat...- Chen WeiTRL4"
    },
    {
      "id": "advanced-food-image-recognition-technology-deep-learning",
      "url": "http://tech.nus.edu.sg/advanced-food-image-recognition-technology-deep-learning",
      "title": "Advanced Food Image Recognition Technology by Deep LearningThe global image recognition market size was valued at nearly US$23 billion in 2018 and is projected to expand at a CAGR of 19% between 2018 and 2025. Within th...- Chua Tat-sengTRL4"
    },
    {
      "id": "multiferroic-material-next-generation-memory-devices",
      "url": "http://tech.nus.edu.sg/multiferroic-material-next-generation-memory-devices",
      "title": "Spintronics, Integrated circuits, OthersMultiferroic Material for Next-Generation Memory DevicesBy 2025, it is estimated that around 463 billion gigabytes of data will be produced daily. Non-volatile memory (NVM) devices that store data even after power is...- Loh Kian Ping, Teng MATRL3"
    },
    {
      "id": "automatic-grammatical-error-correction-system",
      "url": "http://tech.nus.edu.sg/automatic-grammatical-error-correction-system",
      "title": "OtherAutomatic Grammatical Error Correction SystemEnglish may be the third most commonly spoken language in the world but many people continue to struggle with the intricacies of the language, from spelling to ...- Ng Hwee TouTRL6"
    },
    {
      "id": "synthesis-graphene-foam-controllable-pore-sizes",
      "url": "http://tech.nus.edu.sg/synthesis-graphene-foam-controllable-pore-sizes",
      "title": "2D Materials, Energy storageSynthesis of Graphene Foam with Controllable Pore Sizes3D graphene foam shows great promises in energy storage. As an electrode material for energy storage devices like secondary batteries and lithium air batteries,...- Barbaros ÖzyilmazTRL4"
    },
    {
      "id": "skin-white-snow",
      "url": "http://tech.nus.edu.sg/skin-white-snow",
      "title": "Other, OtherSkin as white as snowSkin-whitening ingredients are widely used in the cosmetics industry. Tyrosinase inhibitors are a chief chemical component of skin-whitening agents because of t...- Huang DejianTRL3"
    },
    {
      "id": "light-trapping-layer-greater-solar-panel-efficiency",
      "url": "http://tech.nus.edu.sg/light-trapping-layer-greater-solar-panel-efficiency",
      "title": "Energy storageLight-Trapping Layer for Greater Solar Panel EfficiencyAs environmental concerns mount, the world is turning to renewable energy sources for its power needs. The world’s total renewable-based power capacity is exp...- Kam Zhi Ming, Joel Li Bingrui, Lin Fen, Thomas GascouTRL3"
    },
    {
      "id": "novel-perovskites-photovoltaic-devices",
      "url": "http://tech.nus.edu.sg/novel-perovskites-photovoltaic-devices",
      "title": "Other, OtherNovel Perovskites for Photovoltaic DevicesNovel perovskite derivatives with enhanced stability in ambient conditions for use in solar cells\r\n\r\nPhotovoltaics, or the conversion of light into electricity,...- Loh Kian PingTRL3"
    },
    {
      "id": "high-yield-synthesis-highly-crystalline-covalent-organic-frameworks",
      "url": "http://tech.nus.edu.sg/high-yield-synthesis-highly-crystalline-covalent-organic-frameworks",
      "title": "Other, OtherHigh-Yield Synthesis of Highly Crystalline Covalent Organic FrameworksCovalent Organic Frameworks (COFs) are an emerging class of ordered conjugated organic polymer materials. They are constructed from the covalent linkages of org...- Loh Kian PingTRL2"
    },
    {
      "id": "highly-efficient-silicon-bottom-solar-cell-tandem-application",
      "url": "http://tech.nus.edu.sg/highly-efficient-silicon-bottom-solar-cell-tandem-application",
      "title": "Other, OtherHighly-Efficient Silicon Bottom Solar Cell for Tandem ApplicationAs Solar photovoltaic technology is expected to account for 60% of the rise in the world’s total renewable-based power capacity as it grows by 50% between 201...- Rolf Stangl, Ling Zhi Peng, Wang PuqunTRL3"
    },
    {
      "id": "new-low-cost-method-lithium-ion-battery-recycling",
      "url": "http://tech.nus.edu.sg/new-low-cost-method-lithium-ion-battery-recycling",
      "title": "Other, OtherNew, Low-Cost Method for Lithium Ion Battery RecyclingThere is growing interest in the recycling of used lithium ion batteries as the world accumulates more used batteries, both from an environmental and commercial...- Wang QingTRL4"
    },
    {
      "id": "industrial-liquid-separation-room-temperature",
      "url": "http://tech.nus.edu.sg/industrial-liquid-separation-room-temperature",
      "title": "Separation Technologies, 2D Materials, OthersIndustrial Liquid Separation at Room TemperatureLiquid separation systems are fundamental to a vast number of modern industrial applications. Conventionally, to separate and isolate compounds of interest from...- Antonio Helio de CASTRO NETOTRL4"
    },
    {
      "id": "pushing-boundaries-nanostructure-assembly",
      "url": "http://tech.nus.edu.sg/pushing-boundaries-nanostructure-assembly",
      "title": "Other, OthersPushing the boundaries of nanostructure assemblyThe assembly of nano/microstructures requires patient, skilled researchers, commonly using self-assembly techniques. Challenges arise in ensuring high reproduci...- Ho Ghim WeiTRL3"
    },
    {
      "id": "triphasic-millireactor-fine-chemicals-production",
      "url": "http://tech.nus.edu.sg/triphasic-millireactor-fine-chemicals-production",
      "title": "Other, Other, OthersTriphasic Millireactor for Fine Chemicals ProductionFine chemicals are produced in batch reactors in limited volumes and sold at high prices as starting materials for speciality chemicals, particularly in the pha...- Saif Abdul Kadir Khan, Yan NingTRL2"
    },
    {
      "id": "141",
      "url": "http://tech.nus.edu.sg/product/141",
      "title": "2D Materials, OthersSelf-adaptable Composite MembraneGrowing concerns about water scarcity, increasingly stringent guidelines encouraging proper wastewater recycling as well as demand for more refined industrial p...- Antonio Helio de CASTRO NETO, Daria ANDREEVA-BAEUMLER, Konstantin NOVOSELOVTRL3"
    },
    {
      "id": "147",
      "url": "http://tech.nus.edu.sg/product/147",
      "title": "OthersAlcoholic beverages fermented from spent coffee groundsCoffee drinks are becoming popular all over the world. Instant coffee, brewed coffee, blended coffee drinks ...... about which there is not any lack of coffee m...- Shao Quan LIU, Yunjiao LIU, Wenqian YUANTRL3"
    }
  ]
}